snlkuharlocal/src/Documents/ЗаявкаНаПерепаковку/ЗаявкаНаПерепаковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПерепаковку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СпайкиВПути</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовности</name>
    <comment>Дата готовности</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ДвижениеТовараВнешнегоКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПерепаковку</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееПРМТовар</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееПРМРасходныеМатериалы</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПРМТовар</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПРМРасходныеМатериалы</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНедостачи</name>
    <type>
      <types>DocumentRef.СписаниеТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>DocumentRef.Комплектация</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходнаяНакладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделятьРасходныеМатериалыВОтдельноеПРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыОстатков</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыЗаявокНаПерепаковку/СтатусыЗаявокНаПерепаковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПерепаковку</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученаСкладом</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоНаПерепаковку</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяУПартнёров</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаПерепаковку/ManagerModule.bsl
///////////// СОЗДАТЬ ДОКУМЕНТЫ ///////////////////////////////////////////////////////////////////////////////////

// п.10 и п.12 
Функция СоздатьПеремещение(ДокументСсылка = Неопределено, ТаблицаКЗагрузке, СкладИсточник = Неопределено, СкладПолучатель = Неопределено,
			Комментарий = "", ДополнительныеРеквизиты = Неопределено, Проводить = Истина, СоздаватьНовый = Ложь) Экспорт
	
	Если ТаблицаКЗагрузке.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	Перемещение = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокументСсылка, "Перемещение",,,СоздаватьНовый);
	Перемещение.Дата = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	Перемещение.ДатаОтгрузки = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	Перемещение.ДатаПриемки = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	
	ЗаполнитьШапкуДокумента(Перемещение,ПараметрыСеанса.Пользователь);
	
	Перемещение.ДокОснование = ?(ДокументСсылка <> Неопределено, ДокументСсылка, Неопределено);
	Перемещение.ЗаявкаНаПерепаковку = ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаПерепаковку"), ДокументСсылка, Неопределено);
	
	Перемещение.СкладПолучатель = СкладПолучатель; // ДокументСсылка.Склад
	ОбменЭДО.УстановитьПунктДоставкиСб2б(Перемещение,"СкладПолучатель","ПунктДоставки");
	
	Перемещение.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Перемещение.Курс = 1;
		
	Перемещение.Склад = СкладИсточник;
	Перемещение.Комментарий = ?(СокрЛП(Комментарий) <> "", Комментарий, "Перемещение для Перепаковки" + Строка(ДокументСсылка));
	
	УстановитьНомерДокументаКлиентСервер(Перемещение);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(Перемещение, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Перемещение.Товары.Очистить();
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаКЗагрузке Цикл
		
		НоваяСтрока = Перемещение.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		Если ТаблицаКЗагрузке.Колонки.Найти("Заявка") = Неопределено Тогда
			НоваяСтрока.Заявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("ПодтвержденнаяЗаявка") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("ПодтвержденнаяЗаявкаПеремещения") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявкаПеремещения = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("Коэффициент") = Неопределено Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("Единица") = Неопределено Тогда
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЕсли;
		
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Перемещение);
		РассчитатьСуммуТабЧасти(НоваяСтрока, Перемещение);	
		
	КонецЦикла;

	Попытка
		Перемещение.Записать(?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		СообщитьИзМодуля(""+Перемещение); 
		Возврат Перемещение.Ссылка;
	Исключение
		Перемещение.Записать();
		СообщитьИзМодуля(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// п.11
Функция СоздатьКомплектацию(ДокСсылка, ТаблицаТоваров = Неопределено, ТаблицаКомплектующих = Неопределено, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	Если ТаблицаТоваров.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	ДокКомпл = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "Комплектация");
	
	ЗаполнитьШапкуДокумента(ДокКомпл, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
	
	УстановитьНезаполненныйРеквизитШапки(ДокКомпл,"КодОперации", Перечисления.КодыОперацийОстатки.ЗакупкаР);
	УстановитьНезаполненныйРеквизитШапки(ДокКомпл,"ВидОплаты",ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплаты"));
	
	ДокКомпл.ДокОснование = ДокСсылка;
	ДокКомпл.Склад = ДокСсылка.Склад;
	Если ЗначениеЗаполнено(ДокСсылка.ВходящееПРМТовар) Тогда
		ДокКомпл.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	Иначе
		ДокКомпл.СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;
	КонецЕсли;
	
	УстановитьНомерДокументаКлиентСервер(ДокКомпл);
	ДокКомпл.Комментарий = "Создано документом " + Строка(ДокСсылка);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			ДокКомпл[Элемент.Ключ]=Элемент.Значение;
			//УстановитьНезаполненныйРеквизитШапки(ДокКомпл, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	ДокКомпл.Товары.Очистить();
	
	Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
		НоваяСтрока = ДокКомпл.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		НоваяСтрока.Всего = НоваяСтрока.Количество;
		ЗаполнитьКоличествоКомплектующихПоСтроке(НоваяСтрока);
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокКомпл);
		РассчитатьСуммуТабЧасти(НоваяСтрока, ДокКомпл, "ОтВсего");
	КонецЦикла;
	
	////////////////// КОМПЛЕКТУЮЩИЕ /////////////////////////////////////////////////////////////////////////
	
	Если ТаблицаКомплектующих = Неопределено Тогда
		Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			
			Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
				// комплект
				Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
					
					Если СтрокаКомплекта.Количество = 0 Тогда 
						Продолжить; 
					КонецЕсли; 
					
					НоваяСтрока = ДокКомпл.Комплектующие.Добавить();
					НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
					НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * СтрокаТоваров.Количество;
					НоваяСтрока.Продукция = СтрокаТоваров.Номенклатура;
					НоваяСтрока.Всего = НоваяСтрока.Количество;
					
				КонецЦикла; 
			Иначе			
				// обычный товар
				НоваяСтрока = ДокКомпл.Комплектующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
				НоваяСтрока.Продукция = СтрокаТоваров.Номенклатура;
				НоваяСтрока.Всего = НоваяСтрока.Количество;
			КонецЕсли;
			
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
			
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТоваров ИЗ ТаблицаКомплектующих Цикл
			НоваяСтрока = ДокКомпл.Комплектующие.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			НоваяСтрока.Всего = НоваяСтрока.Количество;
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр ИЗ ДокКомпл.Комплектующие Цикл
		ЗаполнитьКоличествоКомплектующихПоСтроке(Стр);
		ПриИзмененииНоменклатурыТабЧасти(Стр, ДокКомпл);
		РассчитатьСуммуТабЧасти(Стр, ДокКомпл, "ОтВсего");
	КонецЦикла;
	
	Попытка
		ДокКомпл.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(""+ДокКомпл); 
		Возврат ДокКомпл.Ссылка;
	Исключение
		ДокКомпл.Записать();
		СообщитьИзМодуля(""+ДокКомпл); 
		Возврат ДокКомпл.Ссылка;
		//СообщитьИзМодуля(ОписаниеОшибки());
		//Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// п.13
Функция СоздатьСписаниеТМЦ(ДокСсылка, ТаблицаТоваров = Неопределено, Комментарий = "", ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	ДокСписание = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "СписаниеТМЦ");
	
	ЗаполнитьЗначенияСвойств(ДокСписание, ДокСсылка);
	
	ЗаполнитьШапкуДокумента(ДокСписание, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
	
	УстановитьНезаполненныйРеквизитШапки(ДокСписание,"ВидОплаты",	ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплаты"));		
	
	ДокСписание.КодОперации = Перечисления.КодыОперацийОстатки.Списание;	
	ДокСписание.ДокОснование = ДокСсылка;
	
	УстановитьНомерДокументаКлиентСервер(ДокСписание);
	
	Если СокрЛП(Комментарий) <> "" Тогда
		ДокСписание.Комментарий = СокрЛП(Комментарий);
	Иначе
		ДокСписание.Комментарий = "Создано документом " + Строка(ДокСсылка);
	КонецЕсли;
	
	// Шворобей ВЮ 16.01.2023 ++
	Если ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		Если ЕстьРеквизитДокумента("Подразделение", ДокСсылка.ДокОснование.Метаданные()) Тогда
			ДокСписание.Подразделение = ЗначениеРеквизитаОбъекта(ДокСсылка.ДокОснование, "Подразделение");		
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 16.01.2023 ++
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			ДокСписание[Элемент.Ключ]=Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	Если ТаблицаТоваров <> Неопределено Тогда
		
		ДокСписание.Товары.Очистить();
		
		Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			
			НоваяСтрока = ДокСписание.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
			НоваяСтрока.Всего = НоваяСтрока.Количество;
			
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			//    НУЖНО БУДЕТ УСТАНОВИТЬ ЦЕНУ
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			
			НоваяСтрока.Цена = ПолучитьЦенуИзДокументаОснования(НоваяСтрока.Номенклатура, ДокСсылка);
			
			ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокСписание);
			РассчитатьСуммуТабЧасти(НоваяСтрока, ДокСписание);
		КонецЦикла;
		
	КонецЕсли;
	
	// Шворобей ВЮ 08.02.2023 ++
	Если Проводить Тогда
		Попытка
			ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		Исключение
			ДокСписание.Записать();
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		КонецПопытки;
	Иначе
		Попытка
			ДокСписание.Записать();
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		Исключение
			СообщитьИзМодуля("" + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	// Шворобей ВЮ 08.02.2023 ++
	
КонецФункции

// п.14
Функция СоздатьРасходнуюНакладную(ДокСсылка = Неопределено, ТаблицаТоваров, ДополнительныеРеквизиты = Неопределено,
	// Кухарь А.Ю. 06.09.2024 начало
	//+ параметр СообщатьОНулевыхЦенах
	//	Проводить = Ложь, Комментарий = "", ОтгрузкаКомплектов = Ложь, СоздаватьНовый = Ложь, ЗаполнитьДопОбработки = Ложь) Экспорт
	Проводить = Ложь, Комментарий = "", ОтгрузкаКомплектов = Ложь, СоздаватьНовый = Ложь, ЗаполнитьДопОбработки = Ложь, СообщатьОНулевыхЦенах=ложь) Экспорт	 
	// Кухарь А.Ю. 06.09.2024 конец
	
	
	Если ТаблицаТоваров.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	ДокРасходнаяНакладная = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "РасходнаяНакладная", , , СоздаватьНовый);
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	МетаданныеДокСсылка = Неопределено;
	МетаданныеДокСсылка = ?(ДокСсылка <> Неопределено, ДокСсылка.Метаданные(), Неопределено);
	
	ЕстьРеквизитОснование = Ложь;
	Если МетаданныеДокСсылка <> Неопределено Тогда
		ЕстьРеквизитОснование = ЕстьРеквизитДокумента("ДокОснование", МетаданныеДокСсылка);
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ДокСсылка <> Неопределено И ЕстьРеквизитОснование И ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		ЗаполнитьЗначенияСвойств(ДокРасходнаяНакладная, ДокСсылка.ДокОснование);
	ИначеЕсли ДокСсылка <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДокРасходнаяНакладная, ДокСсылка);
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	ЗаполнитьШапкуДокумента(ДокРасходнаяНакладная, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	ДокРасходнаяНакладная.ДокОснование =  ?(ДокСсылка = Неопределено, Неопределено, ДокСсылка);
	ДокРасходнаяНакладная.Комментарий = ?(СокрЛП(Комментарий) <> "", Комментарий, "Создано документом " + Строка(ДокСсылка));
	
	УстановитьНомерДокументаКлиентСервер(ДокРасходнаяНакладная);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(ДокРасходнаяНакладная, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Шворобей ВЮ 29.11.2022 ++
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.СостояниеНакладной) Тогда
		ДокРасходнаяНакладная.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
	КонецЕсли;
	// Шворобей ВЮ 29.11.2022 ++
	
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ТипЦен) Тогда
		ДокРасходнаяНакладная.ТипЦен = ДокРасходнаяНакладная.Контрагент.ТипЦен;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ТипЦенРаспродажа) Тогда
		ДокРасходнаяНакладная.ТипЦенРаспродажа = ДокРасходнаяНакладная.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	ДокРасходнаяНакладная.Товары.Очистить();
	
	Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
		
		НоваяСтрока = ДокРасходнаяНакладная.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("Коэффициент") = Неопределено Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("Единица") = Неопределено Тогда
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("Заявка") = Неопределено Тогда
			НоваяСтрока.Заявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("ПодтвержденнаяЗаявка") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		КонецЕсли;
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////
		//    НУЖНО БУДЕТ УСТАНОВИТЬ ЦЕНУ
		/////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Если ДокСсылка <> Неопределено И ЕстьРеквизитОснование И ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
			НоваяСтрока.Цена = ПолучитьЦенуИзДокументаОснования(НоваяСтрока.Номенклатура, ДокСсылка);
		КонецЕсли;
		
		НоваяСтрока.Всего = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокРасходнаяНакладная);
		РассчитатьСуммуТабЧасти(НоваяСтрока, ДокРасходнаяНакладная);
		
	КонецЦикла;
	
	ДокРасходнаяНакладная.ОтгрузкаКомплектов = ОтгрузкаКомплектов;
	ДокРасходнаяНакладная.Комплектующие.Очистить();
	
	Если ОтгрузкаКомплектов Тогда
		ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ДокРасходнаяНакладная);	
	КонецЕсли;
	
	ДокРасходнаяНакладная.ДопОбработки.Очистить();
	
	Если ЗаполнитьДопОбработки Тогда
		Если ДокРасходнаяНакладная.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
			Для Каждого СтрокаТЧ Из ДокРасходнаяНакладная.Контрагент.ВидыДопОбработок Цикл
				СтрокаДО = ДокРасходнаяНакладная.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из ДокРасходнаяНакладная.ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО = ДокРасходнаяНакладная.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	// Кухарь А.Ю. 06.09.2024 начало
	//
	если СообщатьОНулевыхЦенах тогда
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ
		              |	ТЗ.Номенклатура КАК Номенклатура
		              |ПОМЕСТИТЬ ВремТЗ
		              |ИЗ
		              |	&ТЗ КАК ТЗ
		              |ГДЕ
		              |	ТЗ.Количество > 0
		              |	И ТЗ.Цена = 0
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ВремТЗ.Номенклатура.Наименование КАК НаименованиеНоменклатуры
		              |ИЗ
		              |	ВремТЗ КАК ВремТЗ";
		Запрос.УстановитьПараметр("ТЗ",ДокРасходнаяНакладная.товары.выгрузить());
		ВыборкаПустыхЦен=запрос.Выполнить().Выбрать();
		пока ВыборкаПустыхЦен.Следующий() цикл
			Сообщить(СтрШаблон("Пустая цена у %1",ВыборкаПустыхЦен.НаименованиеНоменклатуры));
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю. 06.09.2024 конец
	
	Попытка
		// Шворобей ВЮ 29.11.2022 ++
		Если Проводить Тогда
			ДокРасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокРасходнаяНакладная.Записать();
		КонецЕсли;
		// Шворобей ВЮ 29.11.2022 ++
		СообщитьИзМодуля("" + ДокРасходнаяНакладная);
		Возврат ДокРасходнаяНакладная.Ссылка;
	Исключение
		СообщитьИзМодуля(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

///////////// ПЕРЕМЕСТИТЬ КОМПЛЕКТУЮЩИЕ ////////////////////////////////////////////////////////////////////////////

Функция ПереместитьСоСкладовОстатковНаСкладПерепаковки(ДокСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура("ТаблицаНехватки, Успешно", Неопределено, Ложь);
	
	//////////////// ВНАЧАЛЕ ПРОВЕРИМ, СКОЛЬКО УЖЕ ЕСТЬ НА СКЛАДЕ ПЕРЕПАКОВКИ ////////////////////////////////
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(ДокСсылка.Склад);
	
	СтруктураОстатковНаСкладеПерепаковки = ПолучитьСтруктуруОстатковНаСкладах(ДокСсылка, МассивСкладов);
	
	ТаблицаНехваткиНаСкладеПерепаковки = СтруктураОстатковНаСкладеПерепаковки.ТаблицаНехватки; // СКОЛЬКО НАМ НЕ ХВАТАЕТ ПЕРЕМЕСТИТЬ
	
	Если СтруктураОстатковНаСкладеПерепаковки.ТаблицаНехватки.Количество() = 0  Тогда
		СообщитьИзМодуля("Нечего перемещать!!!");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	///////////////// НАДО ПЕРЕМЕЩАТЬ ПО ТАБЛИЦЕ НЕХВАТКИ ////////////////////////////////////////////////////
	
	Если ДокСсылка.СкладыОстатков.Количество() = 0 Тогда
		СообщитьИзМодуля("Не заполнены склады остатков!!!");
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	МассивСкладов = Новый Массив;
	Для Каждого Стр ИЗ ДокСсылка.СкладыОстатков Цикл
		МассивСкладов.Добавить(Стр.Склад);	
	КонецЦикла;
	
	//////////////// ИЩЕМ ОСТАТКИ НА СКЛАДАХ ОСТАТКОВ ПО ТАБЛИЦЕ НЕХВАТКИ ////////////////////////////////////
	
	СтруктураОстатковНаСкладах = ПолучитьСтруктуруОстатковНаСкладахПоТаблицеНехватки(ДокСсылка, МассивСкладов, СтруктураОстатковНаСкладеПерепаковки.ТаблицаНехватки);
	
	Если СтруктураОстатковНаСкладах.ТаблицаНехватки.Количество() > 0  Тогда
		СообщитьИзМодуля("Недостаточно свободных остатков на складах остатков!!!");
		СтруктураВозврата.Вставить("ТаблицаНехватки", СтруктураОстатковНаСкладах.ТаблицаНехватки); 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	//////////////// ПЕРЕМЕЩАЕМ ///////////////////////////////////////////////////////////////////////////////
	
	ТаблицаНехватки = ТаблицаНехваткиНаСкладеПерепаковки;
	
	Для Каждого Стр ИЗ ДокСсылка.СкладыОстатков Цикл
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
		Запрос.УстановитьПараметр("Дата", КонецДня(ДокСсылка.Дата));
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ТаблицаНехватки", ТаблицаНехватки);
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаНехватки ИЗ &ТаблицаНехватки КАК ТаблицаНехватки";
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Сводный.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) < СУММА(Сводный.Количество)
		|				И СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) > 0
		|			ТОГДА СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) >= СУММА(Сводный.Количество)
		|					ТОГДА СУММА(Сводный.Количество)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) < СУММА(Сводный.Количество)
		|			ТОГДА СУММА(Сводный.Количество) - (СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Нехватка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(Остатки.Номенклатура, ТаблицаНехватки.Номенклатура) КАК Номенклатура,
		|		ЕСТЬNULL(ТаблицаНехватки.Количество, 0) КАК Количество,
		|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
		|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
		|		0 КАК ВиртуальныйРезерв
		|	ИЗ
		|		ТаблицаНехватки КАК ТаблицаНехватки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата, Склад = &Склад) КАК Остатки
		|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата, Склад = &Склад) КАК Резервы
		|				ПО Остатки.Номенклатура = Резервы.Номенклатура
		|			ПО (Остатки.Номенклатура = ТаблицаНехватки.Номенклатура)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕСТЬNULL(ОстаткиТМЦ.Номенклатура, ТаблицаНехватки.Номенклатура),
		|		0,
		|		ЕСТЬNULL(ОстаткиТМЦ.Количество, 0),
		|		0,
		|		0
		|	ИЗ
		|		ТаблицаНехватки КАК ТаблицаНехватки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		|			ПО (ОстаткиТМЦ.Номенклатура = ТаблицаНехватки.Номенклатура)
		|	ГДЕ
		|		ОстаткиТМЦ.Регистратор = &ДокСсылка
		|		И ОстаткиТМЦ.Склад = &Склад
		|		И ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕСТЬNULL(РезервыТМЦ.Номенклатура, ТаблицаНехватки.Номенклатура),
		|		0,
		|		0,
		|		-ЕСТЬNULL(РезервыТМЦ.Количество, 0),
		|		0
		|	ИЗ
		|		ТаблицаНехватки КАК ТаблицаНехватки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
		|			ПО (РезервыТМЦ.Номенклатура = ТаблицаНехватки.Номенклатура)
		|	ГДЕ
		|		РезервыТМЦ.Регистратор = &ДокСсылка
		|		И РезервыТМЦ.Склад = &Склад) КАК Сводный
		|
		|СГРУППИРОВАТЬ ПО
		|	Сводный.Номенклатура";
		
		Запрос.УстановитьПараметр("Склад", Стр.Склад);
	
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаКЗагрузке = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		// Кухарь А.Ю. 04.05.2022 начало
		// Для того чтобы не создавать пустые ПРМ			
		Если ТаблицаКЗагрузке.Итог("Количество") = 0 Тогда
			Продолжить;
		КонецЕсли; 
		// Кухарь А.Ю. 04.05.2022 конец
		
		Если ТаблицаКЗагрузке.Количество() > 0 Тогда
			НачатьТранзакцию();
			ПеремещениеСсылка = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке, Стр.Склад, ДокСсылка.Склад, "Комплектующие на склад Перепаковки");   // Создаем по ТаблицаОстатков
			Если ПеремещениеСсылка = Неопределено Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			СообщитьИзМодуля("Создан документ " + Строка(ПеремещениеСсылка));
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		ТаблицаНехватки.Очистить();
		Для Каждого Стр ИЗ ТаблицаКЗагрузке Цикл
			Если Стр.Нехватка > 0 Тогда
				НоваяСтрока = ТаблицаНехватки.Добавить();
				НоваяСтрока.Номенклатура = Стр.Номенклатура;
				НоваяСтрока.Количество = Стр.Нехватка;
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаНехватки.Количество() = 0 Тогда // Нечего перемещать, останавливаемся!
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаНехватки.Количество() > 0 Тогда
		СтруктураВозврата.Вставить("ТаблицаНехватки", ТаблицаНехватки);
		СтруктураВозврата.Вставить("Успешно", Ложь);
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.Вставить("ТаблицаНехватки", Неопределено);
		СтруктураВозврата.Вставить("Успешно", Истина);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

Функция ЗакрытьЗаказ(ДокСсылка, ПорогЗакрытия = 50000) Экспорт
	
	НачатьТранзакцию();
	
	// 2. Меняется статус заявки на «закрыт»
	// 5. При проведении заявки в статусе "закрыт", резервы должны сниматься.
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	Если ДокОбъект <> Неопределено Тогда
		
		Попытка
			ДокОбъект.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
		
		ДокОбъект.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.Закрыта;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДокОбъект.Разблокировать();
		Исключение
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	// 3. На каждый из складов в ТЧ товары создаётся документ в состоянии "получено складом".
	
	// a. Если тип склада «Перепаковка» создавать ПРМ со склада документа на склад из строчки на комплектующие. 
	// b. В иных случаях КМП по складу из документа.
	
	//////////////////////////////////// МАССИВ СКЛАДОВ ПЕРЕПАКОВКА ///////////////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Товары.Склад КАК Склад
	|ИЗ
	|	Документ.ЗаявкаНаПерепаковку.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Товары.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипСклада.Перепаковка)
	|	И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Склад";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	УстановитьПривилегированныйРежим(Ложь);
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//++Данилова Е.В. 27.01.2025
	//добавление в запрос расчет штук в комплекте готового комплекта 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Склад КАК Склад,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	|			ТОГДА 0
	|		КОГДА Товары.Номенклатура.ШтукВКомплекте <> 0
	|			ТОГДА Товары.Номенклатура.ШтукВКомплекте
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ШтукВКомплекте,
	|	ЕСТЬNULL(Товары.Количество, 0) * ВЫБОР
	|		КОГДА Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	|			ТОГДА 1
	|		КОГДА Товары.Номенклатура.ШтукВКомплекте <> 0
	|			ТОГДА Товары.Номенклатура.ШтукВКомплекте
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоКомплектующих
	|ИЗ
	|	Документ.ЗаявкаНаПерепаковку.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Товары.Склад = &Склад";
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТаблицаКЗагрузке = Новый ТаблицаЗначений;
	ТаблицаКЗагрузке.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКЗагрузке.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	БуфернаяТаблица = ТаблицаКЗагрузке.СкопироватьКолонки();
	
	////////////////////////// ПЕРЕМЕЩЕНИЯ ////////////////////////////////////////////////////////////////////////////////
	
	Для Каждого Склад ИЗ МассивСкладов Цикл
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		ИтогКоличествоКомплектующих = ТаблицаТоваров.Итог("КоличествоКомплектующих");
		
		ФлагРазбивать = ИтогКоличествоКомплектующих > ПорогЗакрытия;
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Если НЕ ФлагРазбивать Тогда ////// ОДНО ПЕРЕМЕЩЕНИЕ /////////////////////////////////////////////////////////////////
			
			ТаблицаКЗагрузке.Очистить();
			
			Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
				//++Данилова Е.В. 27.01.2025
				//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
				Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 
					И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
					//--Данилова Е.В. 27.01.2025
					// комплект
					Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
						
						Если СтрокаКомплекта.Количество = 0 Тогда 
							Продолжить; 
						КонецЕсли; 
		
						НоваяСтрока = ТаблицаКЗагрузке.Добавить();
						НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
						НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * СтрокаТоваров.Количество;
				
					КонецЦикла; 
				Иначе			
					// обычный товар
					НоваяСтрока = ТаблицаКЗагрузке.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТаблицаКЗагрузке.Количество() > 0 Тогда
				Перемещение = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
				Если Перемещение = Неопределено Тогда
					ОтменитьТранзакцию();
					Возврат Ложь;
				КонецЕсли;
				ТаблицаКЗагрузке.Очистить();
			КонецЕсли;
			
		Иначе //////////// РАЗБИВАЕМ НА НЕСКОЛЬКО ПЕРЕМЕЩЕНИЙ ///////////////////////////////////////////////////////////////////
				
			ТаблицаКЗагрузке.Очистить(); БуфернаяТаблица.Очистить();
			Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
					
				НадоРаспределить = СтрокаТоваров.КоличествоКомплектующих;
					
				Если НадоРаспределить <= ПорогЗакрытия - БуфернаяТаблица.Итог("Количество") Тогда
					////////////////// ЗАПИХИВАЕМ В БУФЕРНУЮ ТАБЛИЦУ ////////////////////////////////////////////////////////////
					////////////////// СМОТРИМ, ТАМ ПУСТО ИЛИ УЖЕ ЧТО-ТО ЕСТЬ ///////////////////////////////////////////////////
					//++Данилова Е.В. 27.01.2025
					//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
					Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 
						И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
						//--Данилова Е.В. 27.01.2025
						// комплект
						Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
					
							Если СтрокаКомплекта.Количество = 0 Тогда 
								Продолжить; 
							КонецЕсли; 
	
							НоваяСтрока = БуфернаяТаблица.Добавить();
							НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
							НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * СтрокаТоваров.Количество;
						КонецЦикла; 
					Иначе			
						// обычный товар
						НоваяСтрока = БуфернаяТаблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
					КонецЕсли;
						
				Иначе ///////////// ЗДЕСЬ ПРИДЕТСЯ ДРОБИТЬ ///////////////////////////////////////////////////////////////////////
					/////////////// НАЙДЕМ КОЛИЧЕСТВО, СКОЛЬКО РАЗ БУДЕМ ДРОБИТЬ ОДИН ТОВАР //////////////////////////////////////
					
					////////////// ПРОВЕРИМ, РАЗДЕЛИТСЯ ЛИ НАЦЕЛО БЕЗ ОСТАТКА ////////////////////////////////////////////////////
						
					Если НадоРаспределить % ПорогЗакрытия = 0 Тогда
						КоличествоИтерацийДеления = Окр(НадоРаспределить / ПорогЗакрытия, 0, РежимОкругления.Окр15как10);
						ФлагПолностьюРазделилось = Истина;
					Иначе
					    КоличествоИтерацийДеления = Окр(НадоРаспределить / ПорогЗакрытия, 0, РежимОкругления.Окр15как10) + 1;
						ФлагПолностьюРазделилось = Ложь;
					КонецЕсли;
						
					УжеРаспределено = 0;
					Для й = 1 По КоличествоИтерацийДеления Цикл
							
						Если й < КоличествоИтерацийДеления Тогда  // ЕСЛИ НЕ ПОСЛЕДНЯЯ ИТЕРАЦИЯ, СОЗДАДИМ ПЕРЕМЕЩЕНИЯ ПО ТОВАРУ
								
							ТаблицаКЗагрузке.Очистить();
							
							ПоСколькоДробим = Окр(ПорогЗакрытия / ?(СтрокаТоваров.ШтукВКомплекте = 0, 1, СтрокаТоваров.ШтукВКомплекте), 0, РежимОкругления.Окр15как10);
							//++Данилова Е.В. 27.01.2025
							//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
							Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0
								И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
								//--Данилова Е.В. 27.01.2025
								// комплект
								Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
								
									Если СтрокаКомплекта.Количество = 0 Тогда 
										Продолжить; 
									КонецЕсли;
									
		                			НоваяСтрока = ТаблицаКЗагрузке.Добавить();
									НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
									НоваяСтрока.Количество = ПоСколькоДробим * СтрокаКомплекта.Количество;
									
									УжеРаспределено = УжеРаспределено + НоваяСтрока.Количество;
								
								КонецЦикла; 
							Иначе			
								// обычный товар
								НоваяСтрока = ТаблицаКЗагрузке.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
								НоваяСтрока.Количество = ПорогЗакрытия;
								УжеРаспределено = УжеРаспределено + НоваяСтрока.Количество;
							КонецЕсли;
							
							Если ТаблицаКЗагрузке.Количество() > 0 Тогда
								Перемещение = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
								Если Перемещение = Неопределено Тогда
									ОтменитьТранзакцию();
									Возврат Ложь;
								КонецЕсли;
								ТаблицаКЗагрузке.Очистить();
							КонецЕсли;
							
						ИначеЕсли й = КоличествоИтерацийДеления И ФлагПолностьюРазделилось Тогда
							////// ИТЕРАЦИЯ ПОСЛЕДНЯЯ, НО КОЛИЧЕСТВО РАЗДЕЛИЛОСЬ БЕЗ ОСТАТКА /////////////////////////////////////
							
							ТаблицаКЗагрузке.Очистить();
							
							ПоСколькоДробим = Окр(ПорогЗакрытия / ?(СтрокаТоваров.ШтукВКомплекте = 0, 1, СтрокаТоваров.ШтукВКомплекте), 0, РежимОкругления.Окр15как10);
							//++Данилова Е.В. 27.01.2025
							//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
							Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 
								И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
							//--Данилова Е.В. 27.01.2025
								// комплект
								Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
								
									Если СтрокаКомплекта.Количество = 0 Тогда 
										Продолжить; 
									КонецЕсли;
									
		                			НоваяСтрока = ТаблицаКЗагрузке.Добавить();
									НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
									НоваяСтрока.Количество = ПоСколькоДробим * СтрокаКомплекта.Количество;
									
									УжеРаспределено = УжеРаспределено + НоваяСтрока.Количество;
								
								КонецЦикла; 
							Иначе			
								// обычный товар
								НоваяСтрока = ТаблицаКЗагрузке.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
								НоваяСтрока.Количество = ПорогЗакрытия;
								УжеРаспределено = УжеРаспределено + НоваяСтрока.Количество;
							КонецЕсли;
							
							Если ТаблицаКЗагрузке.Количество() > 0 Тогда
								Перемещение = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
								Если Перемещение = Неопределено Тогда
									ОтменитьТранзакцию();
									Возврат Ложь;
								КонецЕсли;
								ТаблицаКЗагрузке.Очистить();
							КонецЕсли;
							
						Иначе ////////////// ПОСЛЕДНЯЯ ИТЕРАЦИЯ И ЕСТЬ ОСТАТОК /////////////////////////////////////////////////////
							ОсталосьРаспределить = НадоРаспределить - УжеРаспределено;
							
							Если ОсталосьРаспределить <= 0 Тогда
								Продолжить;
							КонецЕсли;
							/////////////// НАДО ПОНЯТЬ, СМОЖЕМ МЫ ЗАПИХАТЬ В БУФЕРНУЮ ТАБЛИЦУ ИЛИ НЕТ //////////////////////////////
							ПоСколькоДробим = Окр(ОсталосьРаспределить / ?(СтрокаТоваров.ШтукВКомплекте = 0, 1, СтрокаТоваров.ШтукВКомплекте), 0, РежимОкругления.Окр15как10);
							
							ПомещаетсяВБуфернуюТаблицу = ОсталосьРаспределить < ПорогЗакрытия - БуфернаяТаблица.Итог("Количество");
							
							Если НЕ ПомещаетсяВБуфернуюТаблицу Тогда
								/////////// НЕ ПОМЕЩАЕТСЯ В БУФЕРНУЮ ТАБЛИЦУ ////////////////////////////////////////////////////////
								///////// СКИДЫВАЕМ БУФЕР В ПЕРЕМЕЩЕНИЕ И ДЕЛАЕМ НОВУЮ БУФЕРНУЮ ТАБЛИЦУ /////////////////////////////
								/////////////////////////////////////////////////////////////////////////////////////////////////////
								
								Если БуфернаяТаблица.Количество() > 0 Тогда
									Перемещение = СоздатьПеремещение(ДокСсылка, БуфернаяТаблица, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
									Если Перемещение = Неопределено Тогда
										ОтменитьТранзакцию();
										Возврат Ложь;
									КонецЕсли;
									БуфернаяТаблица.Очистить();
								КонецЕсли;
								
							КонецЕсли;
							//++Данилова Е.В. 27.01.2025	
							//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0 Тогда
							Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0
								И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
								//--Данилова Е.В. 27.01.2025
								// комплект
								Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
								
					        		Если СтрокаКомплекта.Количество = 0 Тогда
										Продолжить; 
									КонецЕсли;
								
									НоваяСтрока = БуфернаяТаблица.Добавить();
									НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
									НоваяСтрока.Количество = ПоСколькоДробим;
								КонецЦикла; 
							Иначе			
								// обычный товар
								НоваяСтрока = БуфернаяТаблица.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
								НоваяСтрока.Количество = ПоСколькоДробим;
							КонецЕсли;
						КонецЕсли;
							
					КонецЦикла;	
							
				КонецЕсли;
					
			КонецЦикла;
				
			/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				
			Если ТаблицаКЗагрузке.Количество() > 0 Тогда
				Перемещение = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
				Если Перемещение = Неопределено Тогда
					ОтменитьТранзакцию();
					Возврат Ложь;
				КонецЕсли;
				ТаблицаКЗагрузке.Очистить();
			КонецЕсли;
			
			Если БуфернаяТаблица.Количество() > 0 Тогда
				Перемещение = СоздатьПеремещение(ДокСсылка, БуфернаяТаблица, ДокСсылка.Склад, Склад, "ПРМ на склад " + Строка(Склад), "ПолученоСкладом");
				Если Перемещение = Неопределено Тогда
					ОтменитьТранзакцию();
					Возврат Ложь;
				КонецЕсли;
				БуфернаяТаблица.Очистить();
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	//////////////////// КОМПЛЕКТАЦИИ ///////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.УстановитьПараметр("Склад",ДокСсылка.Склад); 
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивПродукция = ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка = &ДокСсылка
	|	И Комплектующие.Продукция В(&МассивПродукция)";
	
	Запрос.УстановитьПараметр("МассивПродукция", ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"));
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТаблицаТоваров.Количество() > 0 Тогда
		Комплектация = СоздатьКомплектацию(ДокСсылка, ТаблицаТоваров, ТаблицаКомплектующих);
		Если Комплектация = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьСтруктуруОстатковНаСкладах(ДокументСсылка, МассивСкладов) Экспорт
	
	СтруктураОстатков = Новый Структура("ТаблицаОстатков, ТаблицаНехватки");
	
	// Проверим, достаточно ли Товара на складах
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	// Кухарь А.Ю.  10.06.2022 начало
	// Для случаев, когда 1 запчасть в разных спайках, считает некорректно. Нужно схлопывать запчасти
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, Комплектующие.Номенклатура) КАК Номенклатура,
	//|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК Количество,
	//|	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) < ЕСТЬNULL(Комплектующие.Количество, 0)
	//|			ТОГДА ЕСТЬNULL(Комплектующие.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0))
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Нехватка
	//|ИЗ
	//|	Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	//|				&Дата,
	//|				Склад В (&МассивСкладов)
	//|					И Номенклатура В
	//|						(ВЫБРАТЬ
	//|							Комплектующие.Номенклатура КАК Номенклатура
	//|						ИЗ
	//|							Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	//|						ГДЕ
	//|							Комплектующие.Ссылка = &Ссылка)) КАК ОстаткиТМЦОстатки
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	//|					&Дата,
	//|					Склад В (&МассивСкладов)
	//|						И Номенклатура В
	//|							(ВЫБРАТЬ
	//|								Комплектующие.Номенклатура КАК Номенклатура
	//|							ИЗ
	//|								Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	//|							ГДЕ
	//|								Комплектующие.Ссылка = &Ссылка)) КАК РезервыТМЦОстатки
	//|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	//|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	//|		ПО Комплектующие.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	//|ГДЕ
	//|	Комплектующие.Ссылка = &Ссылка";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(Комплектующие.Количество) КАК Количество
	|ПОМЕСТИТЬ ТЗКМП
	|ИЗ
	|	Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектующие.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, Комплектующие.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) < ЕСТЬNULL(Комплектующие.Количество, 0)
	|			ТОГДА ЕСТЬNULL(Комплектующие.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Нехватка
	|ИЗ
	|	ТЗКМП КАК Комплектующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&Дата,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Комплектующие.Номенклатура КАК Номенклатура
	|						ИЗ
	|							Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	|						ГДЕ
	|							Комплектующие.Ссылка = &Ссылка)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					&Дата,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В
	|							(ВЫБРАТЬ
	|								Комплектующие.Номенклатура КАК Номенклатура
	|							ИЗ
	|								Документ.ЗаявкаНаПерепаковку.Комплектующие КАК Комплектующие
	|							ГДЕ
	|								Комплектующие.Ссылка = &Ссылка)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|		ПО Комплектующие.Номенклатура = ОстаткиТМЦОстатки.Номенклатура";
	
	
	// Кухарь А.Ю.  10.06.2022 конец
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНехватки = ТаблицаЗапроса.СкопироватьКолонки();
	Для Каждого Стр ИЗ ТаблицаЗапроса Цикл
		Если Стр.Нехватка > 0 Тогда
			НоваяСтрока = ТаблицаНехватки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.Количество = Стр.Нехватка;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОстатков.Вставить("ТаблицаОстатков", ТаблицаЗапроса);
	СтруктураОстатков.Вставить("ТаблицаНехватки", ТаблицаНехватки);
	
	Возврат СтруктураОстатков;
	
КонецФункции

Функция ПолучитьСтруктуруОстатковНаСкладахПоТаблицеНехватки(ДокументСсылка, МассивСкладов, ТаблицаНехватки) Экспорт
	
	СтруктураОстатков = Новый Структура("ТаблицаОстатков, ТаблицаНехватки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДокументСсылка.Дата));
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНехватки", ТаблицаНехватки);
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаНехватки ИЗ &ТаблицаНехватки КАК ТаблицаНехватки";
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Количество) КАК Количество,
	|	СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) < СУММА(Сводный.Количество)
	|			ТОГДА СУММА(Сводный.Количество) - (СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Нехватка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, ТаблицаНехватки.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(ТаблицаНехватки.Количество, 0) КАК Количество,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		ТаблицаНехватки КАК ТаблицаНехватки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата, Склад В (&МассивСкладов)) КАК Остатки
	|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата, Склад В (&МассивСкладов)) КАК Резервы
	|				ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			ПО (Остатки.Номенклатура = ТаблицаНехватки.Номенклатура)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(ОстаткиТМЦ.Номенклатура, ТаблицаНехватки.Номенклатура),
	|		0,
	|		ЕСТЬNULL(ОстаткиТМЦ.Количество, 0),
	|		0,
	|		0
	|	ИЗ
	|		ТаблицаНехватки КАК ТаблицаНехватки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|			ПО (ОстаткиТМЦ.Номенклатура = ТаблицаНехватки.Номенклатура)
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор = &ДокСсылка
	|		И ОстаткиТМЦ.Склад В(&МассивСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(РезервыТМЦ.Номенклатура, ТаблицаНехватки.Номенклатура),
	|		0,
	|		0,
	|		-ЕСТЬNULL(РезервыТМЦ.Количество, 0),
	|		0
	|	ИЗ
	|		ТаблицаНехватки КАК ТаблицаНехватки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|			ПО (РезервыТМЦ.Номенклатура = ТаблицаНехватки.Номенклатура)
	|	ГДЕ
	|		РезервыТМЦ.Регистратор = &ДокСсылка
	|		И РезервыТМЦ.Склад В(&МассивСкладов)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНехватки = ТаблицаЗапроса.СкопироватьКолонки();
	Для Каждого Стр ИЗ ТаблицаЗапроса Цикл
		Если Стр.Нехватка > 0 Тогда
			НоваяСтрока = ТаблицаНехватки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.Количество = Стр.Нехватка;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОстатков.Вставить("ТаблицаОстатков", ТаблицаЗапроса);
	СтруктураОстатков.Вставить("ТаблицаНехватки", ТаблицаНехватки);
	
	Возврат СтруктураОстатков;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьЦенуИзДокументаОснования(Номенклатура, ДокСсылка, ИмяТабличнойЧастиДокументаСсылка = "Товары", ИмяТабличнойЧастиДокументаОснования = "Товары") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		Возврат 0;
	КонецЕсли;
	
	ИмяДокументаСсылка = ДокСсылка.Метаданные().Имя;
	ИмяДокументаОснования = ДокСсылка.ДокОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТЧ_Основание.Цена, 0)) КАК Цена
	|ИЗ
	|	Документ." + ИмяДокументаСсылка + "." + ИмяТабличнойЧастиДокументаСсылка + " КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаОснования + "." + ИмяТабличнойЧастиДокументаОснования + " КАК ТЧ_Основание
	|		ПО ТЧ.Номенклатура = ТЧ_Основание.Номенклатура
	|ГДЕ
	|	ТЧ.Ссылка = &ДокСсылка
	|	И ТЧ.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
